In [1]:
import pandas as pd
import sqlite3 as sql

In [5]:
conn = sql.connect('database.sqlite')

In [6]:
pd.read_sql_query("Select * from sqlite_master",conn)

,type,name,tbl_name,rootpage,sql
0,table,Salaries,Salaries,2,CREATE TABLE Salaries (\n Id INTEGER PRIMAR...
1,index,salaries_year_idx,Salaries,16566,CREATE INDEX salaries_year_idx ON Salaries (Year)

In [7]:
pd.read_sql_query("Select * from Salaries",conn)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0,400184.25,,9999999.00,567595.43,2011,,San Francisco,
1,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,,335279.91,335279.91,2011,,San Francisco,
2,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.71,198306.9,,332343.61,332343.61,2011,,San Francisco,
3,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737,182234.59,,326373.19,326373.19,2011,,San Francisco,
4,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602,8601,189082.74,,316285.74,316285.74,2011,,San Francisco,
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148648,148650,Roy I Tillery,Custodian,0,0,0,0,0.00,0.00,2014,,San Francisco,PT
148649,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148650,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148651,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148652,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0,0,-618.13,0,-618.13,-618.13,2014,,San Francisco,PT

In [9]:
def sql_query(q):
  return pd.read_sql_query(q,conn)

#### **1. What is the average TotalPayBenefits for each JobTitle? exclude ('Not Provided', 'Not provided')**

In [35]:
q = """select AVG(TotalPayBenefits),JobTitle from salaries
       where JobTitle Not In ('Not Provided', 'Not provided')
       GROUP BY JobTitle
       """
sql_query(q)

      AVG(TotalPayBenefits)                                        JobTitle
0              44035.664337                                   ACCOUNT CLERK
1              47429.268000                                      ACCOUNTANT
2              29031.742917                               ACCOUNTANT INTERN
3              80266.370000                     ACPO,JuvP, Juv Prob (SFERS)
4              67594.400000                                   ACUPUNCTURIST
...                     ...                                             ...
2153           52705.880385                           X-RAY LABORATORY AIDE
2154           69521.123200                           X-Ray Laboratory Aide
2155           53632.870000  YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS
2156           60118.550000                              Youth Comm Advisor
2157           66686.560000                                     ZOO CURATOR

[2158 rows x 2 columns]

#### **2. Show The JobTitle and Overtime Pay for All Employees With Overtime Pay greater than 50000**

In [18]:
q2 = '''select JobTitle,overtimepay from salaries
        where overtimepay > 50000 and JobTitle !="Not provided"'''
sql_query(q2)

                                              JobTitle  OvertimePay
0                      CAPTAIN III (POLICE DEPARTMENT)    106088.18
1                 WIRE ROPE CABLE MAINTENANCE MECHANIC     56120.71
2                   BATTALION CHIEF, (FIRE DEPARTMENT)     89062.90
3                   BATTALION CHIEF, (FIRE DEPARTMENT)     86362.68
4     ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)     71344.88
...                                                ...          ...
2159                                  Transit Operator     51625.42
2160                                  Transit Operator     52550.53
2161                          Track Maintenance Worker     50265.23
2162                         Diagnostic Imaging Tech I     74935.96
2163                           Parking Control Officer     54738.36

[2164 rows x 2 columns]

#### **3. What is the total number of unique employees? exclude ('Not Provided', 'Not provided')**

In [20]:
q3 = '''select distinct EmployeeName from salaries
where EmployeeName Not In ('Not Provided', 'Not provided')'''
sql_query(q3)

              EmployeeName
0           NATHANIEL FORD
1           ALBERT PARDINI
2        CHRISTOPHER CHONG
3          PATRICK GARDNER
4           DAVID SULLIVAN
...                    ...
110803   Afakasi O Afakasi
110804      Kenneth Mackey
110805      Mark W Mcclure
110806  Charlene D Mccully
110807           Joe Lopez

[110808 rows x 1 columns]

#### **4.Show The Top 10 highest Paid Employees**

In [31]:
q4 = '''select Employeename,Totalpay from salaries
order by Totalpay Desc
limit 10
'''
sql_query(q4)

           EmployeeName    TotalPay
0        NATHANIEL FORD  9999999.00
1           David Shinn   471952.64
2            Amy P Hart   390111.98
3        Gary Altenberg   362844.66
4         John Goldberg   350403.41
5           Samson  Lai   347102.32
6       Ellen G Moffatt   344187.46
7  William J Coaker Jr.   339653.70
8        Gregory P Suhr   339282.07
9     Frederick Binkley   337204.86

#### **5.Show All Employees Ordered By Their TotalPay Benefits In Descending Order**

In [34]:
q5 = '''select Employeename,TotalpayBenefits from salaries
order by TotalpayBenefits Desc
'''
sql_query(q5)

                EmployeeName  TotalPayBenefits
0             NATHANIEL FORD         567595.43
1                David Shinn         510732.68
2                 Amy P Hart         479652.21
3       William J Coaker Jr.         436224.36
4             Gregory P Suhr         425815.28
...                      ...               ...
148648          Not provided              0.00
148649      Timothy E Gibson             -2.73
148650        Mark E Laherty             -8.20
148651         David P Kucia            -33.89
148652             Joe Lopez           -618.13

[148653 rows x 2 columns]